Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/shijing__all__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 約軝錯衡，八鸞鶬鶬。以假以享，我受命溥將。自天降康，豐年穰穰。
en: With the naves of their wheels bound with leather, and their ornamented yokes, With the eight bells at their horses' bits all tinkling, (The princes) come to assist at the offerings. We have received the appointment in all its greatness, And from Heaven is our prosperity sent down, Fruitful years of great abundance. (Our ancestor) will come and enjoy (our offerings), And confer on us happiness without limit.

source: 來假來饗，降福無疆。顧予烝嘗，湯孫之將。
en: May he regard our sacrifices of winter and autumn, (Thus) offered by the descendant of Thang!

source: 天命玄鳥，降而生商，宅殷土芒芒。古帝命武湯，正域彼四方。
en: Heaven commissioned the swallow, To descend and give birth to (the father of our) Shang. (His descendants) dwelt in the land of Yin, and became great. (Then) long ago God appointed the martial Thang, To regulate the boundaries throughout the four quarters (of the kingdom).

source: 方命厥后，奄有九有。商之先后，受命不殆，在武丁孫子。
en: (In those) quarters he appointed the princes, And grandly possessed the nine regions. The ​first sovereign of Shang Received the appointment without any element of instability in it, And it is (now) held by the descendant of Wû-ting.

source: 武丁孫子，武王靡不勝。龍旂十乘，大糦是承。
en: The descendant of Wû-ting Is a martial sovereign, equal to every emergency. Ten princes, (who came) with their dragon-emblazoned banners, Bear the large dishes of millet.

source: 邦畿千里，維民所止，肇域彼四海。四海來假，來假祁祁。
en: The royal domain of a thousand lî Is where the people rest; But the boundaries that reach to the four seas commence there.

source: 景員維河，殷受命咸宜，百祿是何。
en: From the four seas they come (to our sacrifices); They come in multitudes. King has the Ho for its outer border. That Yin should have received the appointment (of Heaven) was entirely right;— (Its sovereign) sustains all its dignities.

source: 濬哲維商，長發其祥，洪水芒芒，禹敷下土方。 外大國是疆，幅隕既長。有娀方將，帝立子生商。 玄王桓撥，受小國是達，受大國是達。 率履不越，遂視既發。相土烈烈，海外有截。 帝命不違，至于湯齊。湯降不遟，聖敬日躋。 昭假遟遟，上帝是祗，帝命式于九圍。 受小球大球，為下國綴旒，何天之休？ 不競不絿，不剛不柔，敷政優優，百祿是遒。 受小共大共，為下國駿厖，何天之龍？ 敷奏其勇，不震不動，不戁不竦，百祿是總。 武王載旆，有虔秉鉞。如火烈烈，則莫我敢曷。 苞有三蘖，莫遂莫達，九有有截。韋顧既伐，昆吾夏桀。 昔在中葉，有震且業。允也天子，降予卿士。 實維阿衡，實左右商王。
en: Profoundly wise were (the lords of) Shang, And long had there appeared the omens (of their dignity). When the waters of the deluge spread vast abroad, Yü arranged and divided the regions of the land, And assigned to the exterior great states their boundaries, With their borders extending all over (the kingdom). (Even) then the chief of Sung was beginning to be great, And God raised up the son (of his daughter), and founded (the line of) Shang. The dark king exercised an effective sway. Charged with a small state, he commanded success; Charged with a large state, he commanded success. He followed his rules of conduct without error; Wherever he inspected (the people), they responded (to his instructions). (Then came) Hsiang-thû all ardent, And all within the four seas, beyond (the middle regions), acknowledged his restraints.

source: 撻彼殷武，奮伐荊楚，冞入其阻，裒荊之旅。 有截其所，湯孫之緒。
en: Rapid was the warlike energy of (our king of) Yin, And vigorously did he attack King-Khû. ​Boldly he entered its dangerous passes, And brought the multitudes of King together, Till the country was reduced under complete restraint:— Such was the fitting achievement of the descendant of Thang!

source: 維女荊楚，居國南鄉，昔有成湯，自彼氐羌。 莫敢不來享，莫敢不來王，曰商是常。
en: 'Ye people,' (he said), 'of King-Khû, Dwell in the southern part of my kingdom. Formerly, in the time of Thang the Successful, Even from the Kiang of Tî, They dared not but come with their offerings; (Their chiefs) dared not but come to seek acknowledgment:— Such is the regular rule of Shang.'

source: 天命多辟，設都于禹之績。 歲事來辟，勿予禍適，稼穡匪解。
en: Heaven had given their appointments (to the princes), But where their capitals had been assigned within the sphere of the labours of Yü, For the business of every year they appeared before our king, (Saying), 'Do not punish nor reprove us; We have not been remiss in our husbandry.'

source: 天命降監，下民有嚴，不僭不濫，不敢怠遑。 命于下國，封建厥福。
en: When Heaven by its will is inspecting (the kingdom), The lower people are to be feared. (Our king) showed no partiality (in rewarding), no excess (in punishing); He dared not to allow himself in indolence:— So was his appointment (established) ​over the states, And he made his happiness grandly secure.

source: 商邑翼翼，四方之極，赫赫厥聲，濯濯厥靈。 壽考且寧，以保我後生。
en: The capital of Shang was full of order, The model for all parts of the kingdom. Glorious was (the king's) fame; Brilliant his energy. Long lived he and enjoyed tranquillity, And so he preserves us, his descendants.

source: 陟彼景山，松柏丸丸，是斷是遷，方斵是虔。 松桷有梴，旅楹有閑，寢成孔安。
en: We ascended the hill of King, Where the pines and cypresses grew symmetrical. We cut them down and conveyed them here; We reverently hewed them square. Long are the projecting beams of pine; Large are the many pillars. The temple was completed,—the tranquil abode (of the martial king of Yin).
